# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
# tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'postgresql'
brew 'pnpm'
brew 'node'
brew 'redis'
brew 'yt-dlp'

# Apps
cask 'google-chrome'
cask 'gpg-suite'
cask 'arq'
cask 'imageoptim'
cask 'phpstorm'
cask 'whatsapp'
cask 'signal'
cask 'utm'
cask 'tunnelblick'
cask 'phpstorm'
cask 'android-studio'
cask 'webstorm'
cask 'soundsource'
cask 'moneymoney'
cask 'zoom'
cask 'adobe-creative-cloud'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas "Harvest", id: 506189836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Overcast", id: 888422857
mas "structured-tagesplaner", id: 1499198946
mas "pwsafe-password-safe", id: 520993579
mas "istat-menus", id: 1319778037
mas "goodnotes-5", id: 1444383602